{
    "services": [
        {
            "title": "Web Design",
            "description": "I create clean, modern, and responsive websites that work seamlessly on mobile, tablet, and desktop.I design landing pages, portfolio sites, and other personal or small business websites using HTML, CSS, and JavaScript."
        },
        {
            "title": "Web Maintenance & Updates",
            "description": "I help update existing websites by adjusting text, images, layout, and fixing bugs in HTML/CSS."
        },
        {
            "title": "SEO-Ready Structure",
            "description": "I build websites with proper use of headings, meta tags, and alt text for images. My code is lightweight and optimized for faster page loading, supporting better visibility on search engines."
        },
        {
            "title": "Design to data conversion",
            "description": "I convert visual designs (from Figma, Adobe XD, or Canva) into working, responsive web pages that match the original design closely"
        }
    ],
    "skills": [
        {
            "name": "HTML5",
            "progress": 90
        },
        {
            "name": "CSS",
            "progress": 89
        },
        {
            "name": "JavaScript",
            "progress": 70
        },
        {
            "name": "Git & Github",
            "progress": 72
        },
        {
            "name": "SEO",
            "progress": 40
        },
        {
            "name": "Ms Access",
            "progress": 85
        },
        {
            "name": "SQL",
            "progress": 76
        }
    ],
    "testimonials": [
        {
            "image": "images/",
            "stars": 5,
            "name": "Rebecca",
            "comment": "Martin consistently demonstrates strong dedication and a keen interest in front-end development. His work is well-structured, and he always seeks to improve his skills. A promising developer in the making."
        },
        {
            "image": "images/",
            "stars": 4,
            "name": "Joh Doe",
            "comment": "Collaborating with Martin was a pleasure. He delivered a responsive and clean website ahead of schedule. Highly recommended for his efficiency and attention to detail."
        },
        {
            "image": "images/",
            "stars": 4,
            "name":"Jane Smith",
            "comment": "Martin transformed my design mockups into a beautiful, functional website. His understanding of modern web standards and commitment to quality made the project a success."
        }
    ]
}